{"keras_version": "2.0.8", "class_name": "Model", "backend": "tensorflow", "config": {"name": "model_1", "layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"dtype": "float32", "name": "input_1", "batch_input_shape": [null, 80, 32], "sparse": false}}, {"name": "lstm_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "LSTM", "config": {"dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "recurrent_constraint": null, "stateful": false, "use_bias": true, "activity_regularizer": null, "go_backwards": false, "return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "return_sequences": true, "units": 128, "bias_constraint": null, "kernel_constraint": null, "recurrent_dropout": 0.0, "bias_regularizer": null, "activation": "tanh", "name": "lstm_1", "unroll": false, "trainable": true, "implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, {"name": "lstm_2", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "LSTM", "config": {"dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "recurrent_constraint": null, "stateful": false, "use_bias": true, "activity_regularizer": null, "go_backwards": true, "return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "return_sequences": true, "units": 128, "bias_constraint": null, "kernel_constraint": null, "recurrent_dropout": 0.0, "bias_regularizer": null, "activation": "tanh", "name": "lstm_2", "unroll": false, "trainable": true, "implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, {"name": "concatenate_1", "inbound_nodes": [[["lstm_1", 0, 0, {}], ["lstm_2", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "concatenate_1", "axis": -1, "trainable": true}}, {"name": "lstm_3", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "LSTM", "config": {"dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "recurrent_constraint": null, "stateful": false, "use_bias": true, "activity_regularizer": null, "go_backwards": false, "return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "return_sequences": false, "units": 128, "bias_constraint": null, "kernel_constraint": null, "recurrent_dropout": 0.0, "bias_regularizer": null, "activation": "tanh", "name": "lstm_3", "unroll": false, "trainable": true, "implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, {"name": "lstm_4", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "LSTM", "config": {"dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "recurrent_constraint": null, "stateful": false, "use_bias": true, "activity_regularizer": null, "go_backwards": true, "return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "return_sequences": false, "units": 128, "bias_constraint": null, "kernel_constraint": null, "recurrent_dropout": 0.0, "bias_regularizer": null, "activation": "tanh", "name": "lstm_4", "unroll": false, "trainable": true, "implementation": 0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}}}, {"name": "concatenate_2", "inbound_nodes": [[["lstm_3", 0, 0, {}], ["lstm_4", 0, 0, {}]]], "class_name": "Concatenate", "config": {"name": "concatenate_2", "axis": -1, "trainable": true}}, {"name": "dense_1", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "units": 512, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "name": "dense_1", "use_bias": true, "activity_regularizer": null, "trainable": true}}, {"name": "dense_2", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "units": 8, "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "name": "dense_2", "use_bias": true, "activity_regularizer": null, "trainable": true}}], "output_layers": [["dense_2", 0, 0]], "input_layers": [["input_1", 0, 0]]}}