{"config": {"output_layers": [["dense_2", 0, 0]], "name": "model_1", "layers": [{"config": {"sparse": false, "name": "input_1", "batch_input_shape": [null, 80, 32], "dtype": "float32"}, "name": "input_1", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "name": "lstm_1", "return_sequences": true, "unroll": false, "kernel_regularizer": null, "unit_forget_bias": true, "activation": "tanh", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 128, "activity_regularizer": null, "bias_regularizer": null, "recurrent_constraint": null, "dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "recurrent_regularizer": null, "go_backwards": false, "return_state": false, "use_bias": true, "implementation": 0, "stateful": false, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "bias_constraint": null}, "name": "lstm_1", "class_name": "LSTM", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "name": "lstm_2", "return_sequences": true, "unroll": false, "kernel_regularizer": null, "unit_forget_bias": true, "activation": "tanh", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 128, "activity_regularizer": null, "bias_regularizer": null, "recurrent_constraint": null, "dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "recurrent_regularizer": null, "go_backwards": true, "return_state": false, "use_bias": true, "implementation": 0, "stateful": false, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "bias_constraint": null}, "name": "lstm_2", "class_name": "LSTM", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"axis": -1, "name": "concatenate_1", "trainable": true}, "name": "concatenate_1", "class_name": "Concatenate", "inbound_nodes": [[["lstm_1", 0, 0, {}], ["lstm_2", 0, 0, {}]]]}, {"config": {"recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "name": "lstm_3", "return_sequences": false, "unroll": false, "kernel_regularizer": null, "unit_forget_bias": true, "activation": "tanh", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 128, "activity_regularizer": null, "bias_regularizer": null, "recurrent_constraint": null, "dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "recurrent_regularizer": null, "go_backwards": false, "return_state": false, "use_bias": true, "implementation": 0, "stateful": false, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "bias_constraint": null}, "name": "lstm_3", "class_name": "LSTM", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"config": {"recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "name": "lstm_4", "return_sequences": false, "unroll": false, "kernel_regularizer": null, "unit_forget_bias": true, "activation": "tanh", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 128, "activity_regularizer": null, "bias_regularizer": null, "recurrent_constraint": null, "dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "recurrent_regularizer": null, "go_backwards": true, "return_state": false, "use_bias": true, "implementation": 0, "stateful": false, "recurrent_dropout": 0.0, "recurrent_activation": "hard_sigmoid", "bias_constraint": null}, "name": "lstm_4", "class_name": "LSTM", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"config": {"axis": -1, "name": "concatenate_2", "trainable": true}, "name": "concatenate_2", "class_name": "Concatenate", "inbound_nodes": [[["lstm_3", 0, 0, {}], ["lstm_4", 0, 0, {}]]]}, {"config": {"name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "activation": "tanh", "use_bias": true, "units": 512, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null}, "name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"config": {"name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "activation": "softmax", "use_bias": true, "units": 8, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null}, "name": "dense_2", "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.0.8", "class_name": "Model"}